IDS_DLG_DPLUS_REINF_TEST_MSG                  = "Test ( DLG_DPLUS_REINF )"

IDC_RFM_SELECT_MEMBER                         = "選擇構件"
IDC_RFM_BTN_SELECT_ALL                        = "全選"
IDC_RFM_BTN_SELECT_NONE                       = "取消"

/////// IDD_UFSL_PMODE_DLG
IDC_UFSL_RMAT_FRM_REIN_TYPE                   = "補強類型"
IDC_UFSL_RMAT_LBL_REIN_TYPE                   = "類型"
IDC_UFSL_RMAT_FRM_MATL_INFO                   = "材料"
IDC_UFSL_RPOS_FRM_EXPO_COND                   = "環境條件"
IDC_UFSL_RPOS_LBL_EXPO_COND                   = "狀況"
IDC_UFSL_CHECK_RESULT                         = "檢算結果"
IDC_UFSL_CHK_RTOP_REIN                        = "補強元件 (上方)"
IDC_UFSL_LBL_RTOP_SPAC                        = "間距"
IDC_UFSL_LBL_RTOP_SIZE                        = "尺寸"
IDC_UFSL_LBL_RTOP_NUMB                        = "數量"
IDC_UFSL_CHK_RBOT_REIN                        = "補強元件 (下方)"
IDC_UFSL_LBL_RBOT_SPAC                        = "間距"
IDC_UFSL_LBL_RBOT_SIZE                        = "尺寸"
IDC_UFSL_LBL_RBOT_NUMB                        = "數量"
IDC_UFSL_GET_DATA_FROM_RC_SLAB                = "從 RC樓版 匯入資料 ..."

/////// IDD_UFSL_COPY_DLG
IDD_UFSL_COPY_DLG                             = "從 RC樓版 匯入資料"
IDS_UFSL_NOT_EXIST_RC_SLAB_DATA               = "無RC樓版資料"
IDS_UFSL_COPY_DATA_IS_NOT_SELECTED            = "未選取匯入資料"
IDC_UFSL_COPY_DLG_FRM_SEL_GSLAB               = "選擇RC樓版"
IDC_UFSL_COPY_DLG_FRM_COPY_POSI               = "位置"
IDC_UFSL_COPY_DLG_RDO_POSX_ENDI               = "X向 (上方)"
IDC_UFSL_COPY_DLG_RDO_POSX_ENDM               = "X向 (中央)"
IDC_UFSL_COPY_DLG_RDO_POSX_ENDJ               = "X向 (下方)"
IDC_UFSL_COPY_DLG_RDO_POSY_ENDI               = "Y向 (左側)"
IDC_UFSL_COPY_DLG_RDO_POSY_ENDM               = "Y向 (中央)"
IDC_UFSL_COPY_DLG_RDO_POSY_ENDJ               = "Y向 (右側)"
IDC_UFSL_COPY_DLG_RDO_POSI_MAXS               = "最大值"
IDC_UFSL_COPY_DLG_FRM_SLAB_INFO               = "RC樓版資訊"
IDC_UFSL_COPY_DLG_FRM_COPY_DATA               = "匯入資料"
IDC_UFSL_COPY_DLG_CHK_COPY_MATL               = "材料"
IDC_UFSL_COPY_DLG_CHK_COPY_SECT               = "斷面"
IDC_UFSL_COPY_DLG_CHK_COPY_RBAR               = "鋼筋"
IDC_UFSL_COPY_DLG_CHK_COPY_FORC               = "力量"

/////// IDD_UFBE_RMAT_DLG
IDC_UFBE_RMAT_FRM_REIN_TYPE                   = "補強形式"
IDC_UFBE_RMAT_LBL_REIN_TYPE                   = "形式"
IDC_UFBE_RMAT_FRM_MATL_INFO                   = "材料"

/////// IDD_UFBE_RPOS_DLG
IDC_UFBE_RPOS_FRM_REIN_PROP                   = "補強位置"
IDC_UFBE_RPOS_FRM_PROP_SHEA                   = "剪力補強"
IDC_UFBE_RPOS_LBL_WRAP_TYPE                   = "型式"
IDC_UFBE_RPOS_LBL_SHR_WIDTH                   = "寬度"
IDC_UFBE_RPOS_LBL_SHR_SPACE                   = "間距"
IDC_UFBE_RPOS_FRM_EXPO_COND                   = "環境條件"
IDC_UFBE_RPOS_LBL_EXPO_COND                   = "環境"
IDC_RFM_TBL_POS_DOT                           = "位置"
IDC_RFM_TBL_APPLY                             = "套用"
IDC_RFM_TBL_SIZE                              = "尺寸"
IDC_RFM_TBL_PIECE                             = "數量"

/////// IDD_UFBE_RPOS_LIST_DLG
IDD_UFBE_RPOS_LIST_DLG                        = "補強詳細資料"

/////// IDD_UFBE_PMODE_DLG
IDC_UFBE_CHECK_RESULT                         = "檢核計算結果"
IDC_UFBE_GET_DATA_FROM_RC_BEAM                = "從 RC梁 匯入資料 ..."

/////// IDD_UFBE_FORC_DLG
IDC_GUFBE_LABEL_FORCE_MDL                     = "Mux(DL)"
IDC_GUFBE_LABEL_FORCE_MLL                     = "Mux(LL)"
IDC_GUFBE_LABEL_FORCE_MUX                     = "Mux"
IDC_GUFBE_LABEL_FORCE_VUY                     = "Vuy"

/////// IDD_UFBE_SECT_DLG
IDC_URBE_APPLY_SEISMIC_PROVISIONS             = "套用耐震設計特別規定"

/////// IDD_UFBE_COPY_DLG
IDD_UFBE_COPY_DLG                             = "從 RC梁 匯入資料"
IDC_UFBE_COPY_DLG_FRM_SEL_GURBE               = "選擇RC梁"

IDC_UFBE_COPY_DLG_FRM_COPY_MODE               = "介面模式"
IDC_UFBE_COPY_DLG_RDO_MODE_PMOD               = "專案模式"
IDC_UFBE_COPY_DLG_RDO_MODE_SMOD               = "簡單模式"

IDC_UFBE_COPY_DLG_FRM_COPY_POSI               = "位置"
IDC_UFBE_COPY_DLG_RDO_POSI_ENDI               = "I 端"
IDC_UFBE_COPY_DLG_RDO_POSI_ENDM               = "中央"
IDC_UFBE_COPY_DLG_RDO_POSI_ENDJ               = "J 端"
IDC_UFBE_COPY_DLG_RDO_POSI_MAXS               = "Max ( I, M, J )"

IDC_UFBE_COPY_DLG_FRM_COPY_DATA               = "匯入資料"
IDC_UFBE_COPY_DLG_CHK_COPY_MATL               = "材料"
IDC_UFBE_COPY_DLG_CHK_COPY_SECT               = "斷面"
IDC_UFBE_COPY_DLG_CHK_COPY_RBAR               = "鋼筋"
IDC_UFBE_COPY_DLG_CHK_COPY_FORC               = "力量"

IDC_UFBE_COPY_DLG_FRM_BEAM_INFO               = "RC梁資料"

IDS_UFBE_NOT_EXIST_RC_BEAM_DATA               = "無RC梁資料"
IDS_UFBE_COPY_DATA_IS_NOT_SELECTED            = "未選取匯入資料"

/////// IDD_UFCO_PMODE_DLG
IDC_UFCO_BTN_COPY_URCO                        = "從 RC柱 匯入資料 ..."
IDC_UFCO_RDO_RESULT_BEFORE                    = "補強前"
IDC_UFCO_RDO_RESULT_AFTER                     = "補強後"
IDC_UFCO_CHK_REIN_SHEAR                       = "檢核剪力強度"

/////// IDD_UFCO_COPY_DLG
IDD_UFCO_COPY_DLG                             = "從 RC柱 匯入資料"
IDC_UFCO_COPY_DLG_FRM_SEL_GURCO               = "選擇RC柱"
IDC_UFCO_COPY_DLG_FRM_COPY_DATA               = "匯入資料"
IDS_UFCO_NOT_EXIST_RC_COLUMN_DATA             = "無RC柱資料"
IDS_UFCO_COPY_DATA_IS_NOT_SELECTED            = "未選取匯入資料"
